---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SubregionNoHostSurf
source: html/1bc32b47-3b34-97ca-83d9-94913f579bfb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SubregionNoHostSurf Property

A Subregion cannot be created outside the boundary of a Toposurface.
 A Subregion should be completely inside a Toposurface or overlap a Toposurface.

## Syntax (C#)
```csharp
public static FailureDefinitionId SubregionNoHostSurf { get; }
```